"""
데이터 관리 관련 상수 정의
다른 공연에서도 재사용 가능한 공통 데이터
"""

# 연령대 목록
AGE_GROUPS = [
    '20세 이하',
    '21 ~ 30세',
    '31 ~ 40세',
    '41 ~ 50세',
    '50세 이상',
    '알수 없음'
]

# 지역 목록
REGIONS = [
    '서울',
    '경기',
    '인천',
    '대구',
    '충남',
    '충북',
    '강원',
    '대전',
    '광주',
    '경남',
    '경북',
    '부산',
    '전북',
    '전남',
    '울산',
    '세종',
    '제주',
    '알수 없음'
]

# 서울 지역 목록
SEOUL_REGIONS = [
    '강남구',
    '강동구',
    '강북구',
    '강서구',
    '관악구',
    '광진구',
    '구로구',
    '금천구',
    '노원구',
    '도봉구',
    '동대문구',
    '동작구',
    '마포구',
    '서대문구',
    '서초구',
    '성동구',
    '성북구',
    '송파구',
    '양천구',
    '영등포구',
    '용산구',
    '은평구',
    '종로구',
    '중구',
    '중랑구',
    '알수 없음'
]

# 경기 지역 목록
GYEONGGI_REGIONS = [
    '고양시',
    '과천시',
    '광주시',
    '구리시',
    '군포시',
    '김포시',
    '남양주시',
    '부천시',
    '성남시',
    '수원시',
    '안산시',
    '안양시',
    '양주시',
    '양평군',
    '오산시',
    '용인시',
    '의왕시',
    '의정부시',
    '이천시',
    '파주시',
    '평택시',
    '하남시',
    '화성시',
    '알수 없음'
]

